{
  "_name_or_path": "/mnt/public/mjwei/download_models/openvla/openvla-7b",
  "arch_specifier": "no-align+fused-gelu-mlp",
  "architectures": [
    "OpenVLAForActionPrediction"
  ],
  "auto_map": {
    "AutoConfig": "configuration_prismatic.OpenVLAConfig",
    "AutoModelForVision2Seq": "modeling_prismatic.OpenVLAForActionPrediction"
  },
  "hf_llm_id": "meta-llama/Llama-2-7b-hf",
  "image_resize_strategy": "resize-naive",
  "image_sizes": [
    224,
    224
  ],
  "llm_backbone_id": "llama2-7b-pure",
  "llm_max_length": 2048,
  "model_type": "openvla",
  "n_action_bins": 256,
  "norm_stats": {
    "libero_10": {
      "action": {
        "mask": [
          true,
          true,
          true,
          true,
          true,
          true,
          false
        ],
        "max": [
          0.9375,
          0.9375,
          0.9375,
          0.30000001192092896,
          0.29357144236564636,
          0.375,
          1.0
        ],
        "mean": [
          0.01820324920117855,
          0.05858374014496803,
          -0.05592384561896324,
          0.004626928828656673,
          0.00289608770981431,
          -0.007673131301999092,
          0.5457824468612671
        ],
        "min": [
          -0.9375,
          -0.9375,
          -0.9375,
          -0.23642857372760773,
          -0.3053571283817291,
          -0.3675000071525574,
          0.0
        ],
        "q01": [
          -0.6348214149475098,
          -0.7741071581840515,
          -0.7633928656578064,
          -0.09749999642372131,
          -0.14819999992847435,
          -0.2742857038974762,
          0.0
        ],
        "q99": [
          0.7714285850524902,
          0.8464285731315613,
          0.9375,
          0.13928571343421936,
          0.15964286029338837,
          0.3246428668498993,
          1.0
        ],
        "std": [
          0.2825464606285095,
          0.35904666781425476,
          0.3673802614212036,
          0.03770702704787254,
          0.05429719388484955,
          0.08725254982709885,
          0.49815231561660767
        ]
      },
      "num_trajectories": 379,
      "num_transitions": 101469,
      "proprio": {
        "max": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ],
        "mean": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ],
        "min": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ],
        "q01": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ],
        "q99": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ],
        "std": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    }
  },
  "output_projector_states": false,
  "pad_to_multiple_of": 64,
  "pad_token_id": 32000,
  "text_config": {
    "model_type": "llama",
    "pad_token_id": 32000,
    "torch_dtype": "bfloat16",
    "vocab_size": 32064
  },
  "timm_model_ids": [
    "vit_large_patch14_reg4_dinov2.lvd142m",
    "vit_so400m_patch14_siglip_224"
  ],
  "timm_override_act_layers": [
    null,
    null
  ],
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_fused_vision_backbone": true,
  "vision_backbone_id": "dinosiglip-vit-so-224px"
}